---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.ConstructionName
source: html/548ad4eb-64c6-c5b8-d4ca-636980124c67.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.ConstructionName Property

The name of the construction

## Syntax (C#)
```csharp
public string ConstructionName { get; }
```